; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=9, locations=12, density=0.7878787878787878, fully_connected=False, max_capacity=2, out_folder=./dense/training, instance_id=20, seed=61

(define (problem transport-20)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l6)
    (at p3 l12)
    (at p4 l1)
    (at p5 l8)
    (at p6 l6)
    (at p7 l6)
    (at p8 l2)
    (at p9 l7)
    (at v1 l8)
    (at v2 l6)
    (at v3 l3)
    (at v4 l6)
    (road l6 l9)
    (road l9 l1)
    (road l5 l6)
    (road l10 l6)
    (road l2 l12)
    (road l12 l2)
    (road l6 l10)
    (road l10 l12)
    (road l8 l6)
    (road l12 l10)
    (road l6 l4)
    (road l11 l4)
    (road l7 l5)
    (road l1 l9)
    (road l9 l6)
    (road l6 l5)
    (road l4 l11)
    (road l4 l6)
    (road l6 l8)
    (road l5 l7)
    (road l4 l3)
    (road l3 l4)
    (road l4 l7)
    (road l7 l4)
    (road l2 l11)
    (road l11 l2)
    (road l8 l10)
    (road l10 l8)
    (road l7 l10)
    (road l10 l7)
    (road l3 l6)
    (road l6 l3)
    (road l10 l11)
    (road l11 l10)
    (road l5 l11)
    (road l11 l5)
    (road l2 l10)
    (road l10 l2)
    (road l2 l9)
    (road l9 l2)
    (road l7 l9)
    (road l9 l7)
    (road l6 l12)
    (road l12 l6)
    (road l3 l7)
    (road l7 l3)
    (road l9 l12)
    (road l12 l9)
    (road l4 l10)
    (road l10 l4)
    (road l6 l11)
    (road l11 l6)
    (road l1 l12)
    (road l12 l1)
    (road l8 l12)
    (road l12 l8)
    (road l5 l8)
    (road l8 l5)
    (road l5 l10)
    (road l10 l5)
    (road l1 l4)
    (road l4 l1)
    (road l7 l11)
    (road l11 l7)
    (road l5 l12)
    (road l12 l5)
    (road l2 l5)
    (road l5 l2)
    (road l4 l12)
    (road l12 l4)
    (road l9 l11)
    (road l11 l9)
    (road l2 l8)
    (road l8 l2)
    (road l1 l3)
    (road l3 l1)
    (road l2 l3)
    (road l3 l2)
    (road l8 l9)
    (road l9 l8)
    (road l6 l7)
    (road l7 l6)
    (road l7 l8)
    (road l8 l7)
    (road l1 l10)
    (road l10 l1)
    (road l2 l6)
    (road l6 l2)
    (road l3 l11)
    (road l11 l3)
    (road l1 l6)
    (road l6 l1)
    (road l3 l8)
    (road l8 l3)
    (road l4 l8)
    (road l8 l4)
    (road l1 l8)
    (road l8 l1)
    (road l9 l10)
    (road l10 l9)
    (road l4 l5)
    (road l5 l4)
    )
 (:goal  (and 
    (at p1 l2)
    (at p2 l12)
    (at p3 l4)
    (at p4 l3)
    (at p5 l2)
    (at p6 l10)
    (at p7 l1)
    (at p8 l12)
    (at p9 l4))))

; plan
1. (pick-up v1 l8 p5 c1 c2)
   deleted: (at p5 l8) (capacity v1 c2)
   added: (in p5 v1) (capacity v1 c1)
   goals met: 0 of 9
2. (pick-up v2 l6 p2 c0 c1)
   deleted: (at p2 l6) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 0 of 9
3. (pick-up v4 l6 p6 c1 c2)
   deleted: (at p6 l6) (capacity v4 c2)
   added: (in p6 v4) (capacity v4 c1)
   goals met: 0 of 9
4. (pick-up v4 l6 p7 c0 c1)
   deleted: (at p7 l6) (capacity v4 c1)
   added: (in p7 v4) (capacity v4 c0)
   goals met: 0 of 9
5. (drive v4 l6 l1)
   deleted: (at v4 l6)
   added: (at v4 l1)
   goals met: 0 of 9
6. (drop v4 l1 p7 c0 c1)
   deleted: (in p7 v4) (capacity v4 c0)
   added: (at p7 l1) (capacity v4 c1)
   goals met: 1 of 9
7. (drive v4 l1 l10)
   deleted: (at v4 l1)
   added: (at v4 l10)
   goals met: 1 of 9
8. (drop v4 l10 p6 c1 c2)
   deleted: (in p6 v4) (capacity v4 c1)
   added: (at p6 l10) (capacity v4 c2)
   goals met: 2 of 9
9. (drive v3 l3 l1)
   deleted: (at v3 l3)
   added: (at v3 l1)
   goals met: 2 of 9
10. (pick-up v3 l1 p4 c0 c1)
   deleted: (at p4 l1) (capacity v3 c1)
   added: (in p4 v3) (capacity v3 c0)
   goals met: 2 of 9
11. (drive v3 l1 l3)
   deleted: (at v3 l1)
   added: (at v3 l3)
   goals met: 2 of 9
12. (drop v3 l3 p4 c0 c1)
   deleted: (in p4 v3) (capacity v3 c0)
   added: (at p4 l3) (capacity v3 c1)
   goals met: 3 of 9
13. (drive v2 l6 l12)
   deleted: (at v2 l6)
   added: (at v2 l12)
   goals met: 3 of 9
14. (drop v2 l12 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l12) (capacity v2 c1)
   goals met: 4 of 9
15. (pick-up v2 l12 p3 c0 c1)
   deleted: (at p3 l12) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 4 of 9
16. (drive v2 l12 l4)
   deleted: (at v2 l12)
   added: (at v2 l4)
   goals met: 4 of 9
17. (drop v2 l4 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l4) (capacity v2 c1)
   goals met: 5 of 9
18. (drive v1 l8 l12)
   deleted: (at v1 l8)
   added: (at v1 l12)
   goals met: 5 of 9
19. (drive v2 l4 l7)
   deleted: (at v2 l4)
   added: (at v2 l7)
   goals met: 5 of 9
20. (pick-up v2 l7 p9 c0 c1)
   deleted: (at p9 l7) (capacity v2 c1)
   added: (in p9 v2) (capacity v2 c0)
   goals met: 5 of 9
21. (drive v2 l7 l4)
   deleted: (at v2 l7)
   added: (at v2 l4)
   goals met: 5 of 9
22. (drop v2 l4 p9 c0 c1)
   deleted: (in p9 v2) (capacity v2 c0)
   added: (at p9 l4) (capacity v2 c1)
   goals met: 6 of 9
23. (drive v1 l12 l2)
   deleted: (at v1 l12)
   added: (at v1 l2)
   goals met: 6 of 9
24. (drop v1 l2 p5 c1 c2)
   deleted: (in p5 v1) (capacity v1 c1)
   added: (at p5 l2) (capacity v1 c2)
   goals met: 7 of 9
25. (pick-up v1 l2 p8 c1 c2)
   deleted: (at p8 l2) (capacity v1 c2)
   added: (in p8 v1) (capacity v1 c1)
   goals met: 7 of 9
26. (drive v1 l2 l12)
   deleted: (at v1 l2)
   added: (at v1 l12)
   goals met: 7 of 9
27. (drop v1 l12 p8 c1 c2)
   deleted: (in p8 v1) (capacity v1 c1)
   added: (at p8 l12) (capacity v1 c2)
   goals met: 8 of 9
28. (drive v1 l12 l2)
   deleted: (at v1 l12)
   added: (at v1 l2)
   goals met: 8 of 9
29. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 8 of 9
30. (pick-up v1 l5 p1 c1 c2)
   deleted: (at p1 l5) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 8 of 9
31. (drive v1 l5 l2)
   deleted: (at v1 l5)
   added: (at v1 l2)
   goals met: 8 of 9
32. (drop v1 l2 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l2) (capacity v1 c2)
   goals met: 9 of 9
